{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "b_constraint": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "nb_filter": 64, "W_regularizer": null, "batch_input_shape": [null, 3, 32, 32], "trainable": true, "W_constraint": null, "name": "convolution2d_1", "nb_col": 3, "input_dtype": "float32", "nb_row": 3, "activity_regularizer": null, "border_mode": "full", "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "b_constraint": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "nb_filter": 64, "W_regularizer": null, "trainable": true, "W_constraint": null, "name": "convolution2d_2", "nb_col": 3, "nb_row": 3, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "th", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "b_constraint": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "nb_filter": 96, "W_regularizer": null, "trainable": true, "W_constraint": null, "name": "convolution2d_3", "nb_col": 3, "nb_row": 3, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "b_constraint": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "nb_filter": 96, "W_regularizer": null, "trainable": true, "W_constraint": null, "name": "convolution2d_4", "nb_col": 3, "nb_row": 3, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "th", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.25}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "b_constraint": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "nb_filter": 128, "W_regularizer": null, "trainable": true, "W_constraint": null, "name": "convolution2d_5", "nb_col": 3, "nb_row": 3, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "b_constraint": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "nb_filter": 128, "W_regularizer": null, "trainable": true, "W_constraint": null, "name": "convolution2d_6", "nb_col": 3, "nb_row": 3, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_3", "pool_size": [2, 2], "dim_ordering": "th", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activation": "linear", "trainable": true, "W_constraint": null, "name": "dense_1", "output_dim": 512, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Dense", "config": {"input_dim": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activation": "linear", "trainable": true, "W_constraint": null, "name": "dense_2", "output_dim": 10, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "softmax"}}]}