{"config": [{"config": {"batch_input_shape": [null, 3, 32, 32], "name": "convolution2d_1", "bias": true, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "dim_ordering": "th", "subsample": [1, 1], "nb_filter": 64, "nb_col": 3, "b_constraint": null, "W_constraint": null, "border_mode": "full", "activity_regularizer": null, "activation": "linear", "input_dtype": "float32", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "name": "convolution2d_2", "bias": true, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "th", "subsample": [1, 1], "nb_filter": 64, "nb_col": 3, "trainable": true, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "th", "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "name": "convolution2d_3", "bias": true, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "th", "subsample": [1, 1], "nb_filter": 96, "nb_col": 3, "trainable": true, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "name": "convolution2d_4", "bias": true, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "th", "subsample": [1, 1], "nb_filter": 96, "nb_col": 3, "trainable": true, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "th", "pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "name": "convolution2d_5", "bias": true, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "th", "subsample": [1, 1], "nb_filter": 128, "nb_col": 3, "trainable": true, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "name": "convolution2d_6", "bias": true, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "th", "subsample": [1, 1], "nb_filter": 128, "nb_col": 3, "trainable": true, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "th", "pool_size": [2, 2], "name": "maxpooling2d_3", "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "activation": "linear", "W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "output_dim": 512, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "activation": "linear", "W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "output_dim": 10, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_8", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "keras_version": "1.1.2", "class_name": "Sequential"}