{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "input_dtype": "float32", "W_constraint": null, "border_mode": "full", "dim_ordering": "th", "activity_regularizer": null, "nb_filter": 96, "W_regularizer": null, "nb_row": 3, "trainable": true, "name": "convolution2d_1", "batch_input_shape": [null, 3, 32, 32], "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "W_constraint": null, "border_mode": "valid", "dim_ordering": "th", "activity_regularizer": null, "nb_filter": 96, "W_regularizer": null, "nb_row": 3, "trainable": true, "name": "convolution2d_2", "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "W_constraint": null, "border_mode": "valid", "dim_ordering": "th", "activity_regularizer": null, "nb_filter": 128, "W_regularizer": null, "nb_row": 3, "trainable": true, "name": "convolution2d_3", "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "W_constraint": null, "border_mode": "valid", "dim_ordering": "th", "activity_regularizer": null, "nb_filter": 128, "W_regularizer": null, "nb_row": 3, "trainable": true, "name": "convolution2d_4", "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "W_constraint": null, "border_mode": "valid", "dim_ordering": "th", "activity_regularizer": null, "nb_filter": 256, "W_regularizer": null, "nb_row": 3, "trainable": true, "name": "convolution2d_5", "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.25}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "W_constraint": null, "border_mode": "valid", "dim_ordering": "th", "activity_regularizer": null, "nb_filter": 256, "W_regularizer": null, "nb_row": 3, "trainable": true, "name": "convolution2d_6", "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "W_constraint": null, "border_mode": "valid", "dim_ordering": "th", "activity_regularizer": null, "nb_filter": 512, "W_regularizer": null, "nb_row": 3, "trainable": true, "name": "convolution2d_7", "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 10, "W_regularizer": null, "trainable": true, "name": "dense_1", "activation": "linear", "init": "glorot_uniform", "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "softmax"}}]}