{"config": [{"config": {"nb_filter": 64, "nb_row": 3, "nb_col": 3, "activity_regularizer": null, "border_mode": "full", "b_regularizer": null, "subsample": [1, 1], "input_dtype": "float32", "activation": "linear", "trainable": true, "name": "convolution2d_1", "bias": true, "init": "glorot_uniform", "dim_ordering": "th", "W_regularizer": null, "batch_input_shape": [null, 3, 32, 32], "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"nb_row": 3, "nb_col": 3, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "activation": "linear", "trainable": true, "nb_filter": 64, "bias": true, "init": "glorot_uniform", "dim_ordering": "th", "W_regularizer": null, "name": "convolution2d_2", "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.25}, "class_name": "Dropout"}, {"config": {"nb_row": 3, "nb_col": 3, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "activation": "linear", "trainable": true, "nb_filter": 96, "bias": true, "init": "glorot_uniform", "dim_ordering": "th", "W_regularizer": null, "name": "convolution2d_3", "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"nb_row": 3, "nb_col": 3, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "activation": "linear", "trainable": true, "nb_filter": 96, "bias": true, "init": "glorot_uniform", "dim_ordering": "th", "W_regularizer": null, "name": "convolution2d_4", "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.25}, "class_name": "Dropout"}, {"config": {"nb_row": 3, "nb_col": 3, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "activation": "linear", "trainable": true, "nb_filter": 128, "bias": true, "init": "glorot_uniform", "dim_ordering": "th", "W_regularizer": null, "name": "convolution2d_5", "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"nb_row": 3, "nb_col": 3, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "activation": "linear", "trainable": true, "nb_filter": 128, "bias": true, "init": "glorot_uniform", "dim_ordering": "th", "W_regularizer": null, "name": "convolution2d_6", "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_3", "border_mode": "valid", "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "input_dim": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "output_dim": 512, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "input_dim": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "output_dim": 10, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_8"}, "class_name": "Activation"}], "keras_version": "1.1.2", "class_name": "Sequential"}