{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "input_dtype": "float32", "bias": true, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "W_constraint": null, "b_regularizer": null, "nb_filter": 96, "batch_input_shape": [null, 3, 32, 32], "dim_ordering": "th", "name": "convolution2d_1", "nb_col": 3, "nb_row": 3, "border_mode": "full", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "nb_filter": 96, "dim_ordering": "th", "name": "convolution2d_2", "nb_col": 3, "nb_row": 3, "border_mode": "valid", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "nb_filter": 128, "dim_ordering": "th", "name": "convolution2d_3", "nb_col": 3, "nb_row": 3, "border_mode": "valid", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "nb_filter": 128, "dim_ordering": "th", "name": "convolution2d_4", "nb_col": 3, "nb_row": 3, "border_mode": "valid", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "nb_filter": 256, "dim_ordering": "th", "name": "convolution2d_5", "nb_col": 3, "nb_row": 3, "border_mode": "valid", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.25, "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "nb_filter": 256, "dim_ordering": "th", "name": "convolution2d_6", "nb_col": 3, "nb_row": 3, "border_mode": "valid", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "nb_filter": 512, "dim_ordering": "th", "name": "convolution2d_7", "nb_col": 3, "nb_row": 3, "border_mode": "valid", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "W_constraint": null, "b_regularizer": null, "output_dim": 10, "name": "dense_1", "trainable": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "softmax"}}]}