{"config": [{"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "name": "convolution2d_1", "b_constraint": null, "bias": true, "nb_col": 3, "nb_row": 3, "batch_input_shape": [null, 3, 32, 32], "input_dtype": "float32", "activation": "linear", "W_constraint": null, "subsample": [1, 1], "dim_ordering": "th", "border_mode": "full", "activity_regularizer": null, "nb_filter": 64, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "name": "convolution2d_2", "b_constraint": null, "bias": true, "nb_col": 3, "nb_row": 3, "nb_filter": 64, "activation": "linear", "W_constraint": null, "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "name": "convolution2d_3", "b_constraint": null, "bias": true, "nb_col": 3, "nb_row": 3, "nb_filter": 96, "activation": "linear", "W_constraint": null, "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "name": "convolution2d_4", "b_constraint": null, "bias": true, "nb_col": 3, "nb_row": 3, "nb_filter": 96, "activation": "linear", "W_constraint": null, "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "name": "convolution2d_5", "b_constraint": null, "bias": true, "nb_col": 3, "nb_row": 3, "nb_filter": 128, "activation": "linear", "W_constraint": null, "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "name": "convolution2d_6", "b_constraint": null, "bias": true, "nb_col": 3, "nb_row": 3, "nb_filter": 128, "activation": "linear", "W_constraint": null, "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.25, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "name": "dense_1", "W_constraint": null, "input_dim": null, "bias": true, "output_dim": 512, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "name": "dense_2", "W_constraint": null, "input_dim": null, "bias": true, "output_dim": 10, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_8", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.2"}